{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-SMALL_MOLECULE",
    "10": "I-TISSUE",
    "11": "B-ORGANISM",
    "12": "I-ORGANISM",
    "13": "B-EXP_ASSAY",
    "14": "I-EXP_ASSAY",
    "15": "B-DISEASE",
    "16": "I-DISEASE",
    "17": "B-CELL_LINE",
    "18": "I-CELL_LINE",
    "2": "I-SMALL_MOLECULE",
    "3": "B-GENEPROD",
    "4": "I-GENEPROD",
    "5": "B-SUBCELLULAR",
    "6": "I-SUBCELLULAR",
    "7": "B-CELL_TYPE",
    "8": "I-CELL_TYPE",
    "9": "B-TISSUE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CELL_LINE": 17,
    "B-CELL_TYPE": 7,
    "B-DISEASE": 15,
    "B-EXP_ASSAY": 13,
    "B-GENEPROD": 3,
    "B-ORGANISM": 11,
    "B-SMALL_MOLECULE": 1,
    "B-SUBCELLULAR": 5,
    "B-TISSUE": 9,
    "I-CELL_LINE": 18,
    "I-CELL_TYPE": 8,
    "I-DISEASE": 16,
    "I-EXP_ASSAY": 14,
    "I-GENEPROD": 4,
    "I-ORGANISM": 12,
    "I-SMALL_MOLECULE": 2,
    "I-SUBCELLULAR": 6,
    "I-TISSUE": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.35.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
